{
  "rationale": "I'm voting 'Yes' on the 200M NCL proposal in Cardano Governance.\n\nAn NCL isn't something we should \"get over the line\".\n\nCardano has just delivered its first form of truly decentralized governance. Before this governance was launched, it had amassed millions of wallets, thousands of developers, and thousands of stake pools. \n\nBy spending any amount of ADA from our 1.7B~ treasury on anything other than maintaining current operations, we assume that this ADA will grow the utility of the blockchain enough to attract an equal or greater number of buyers than the ADA sold for development.\n\nTo spend this ADA effectively, there needs to be enough trusted and competent operators in the community with accessible tooling for dReps to spend this ADA effectively. \n\nWhile I believe there are many competent entities, dReps, and individuals in our community, I do not think we currently have an effective/efficient governance process or the required tooling to distribute 350M ADA. \n\nThe reason I am bringing up the 350M ADA number is due to the recent acceptance of a 350M NCL for Cardano in 2025. \n\nI created my dRep keys in Linux using CLI. This is common practice for many stakepool operators, as you can keep your keys on a 'cold machine' that never touches the internet. \n\nGov(dot)tools has had an ongoing budget process for the last few weeks. This budget process has allowed dReps to vote on what proposals they would like to include in different budget categories. Any dRep that has created their keys through CLI, or a smart-contract could not vote in this process. \n\nAfter weeks of individuals voting in this process with hot wallets, a new tool called Ekklesia was launched. Ekklesia allowed dReps to vote with CLI keys, and hot wallets. This new tool was launched on a weekend and gave dReps 48 hours to vote on what items they believed should be in the budget. Many dReps were under the presumption that gov(dot)tools was the official way to vote on the budget process and had invested countless hours into this process before the new tool was launched. \n\nNow they had 48 hours on a weekend to vote with a new tool. This deadline was then extended a day later to May 5th 2025. I personally am very supportive of this extension, however, it proved to me our tooling/process is not ready to spend 350 Million ADA. Especially considering the original tooling didn't allow CLI keys to vote. \n\nChoosing a 200M NCL represents a 42% reduction in ADA expenditure in 2025. I believe this reduction will allow us to learn more about how we ought to govern Cardano with less risk, and build tooling while still allowing us to innovate.\n\nArguments against the 200M NCL:\n\n- You want to cut IOG's budget.\n\nResponse: I don't want to cut IOG's budget. IOG has delivered on Cardano. Let them propose to the community what they need for 2025, I will vote yes on it. You do not have to have a NCL of 350M to fund IOG. There's only 8 months left in 2025.\n\n- Cardano can't innovate without a 350M NCL.\n\nResponse: Many of us are invested in Cardano. Incentives are aligned for us to make this blockchain succeed with a lower NCL in 2025. If capital is greatly needed, we can revisit in 2026 with proper tooling and more experience. Let's not forget the Cardano Foundation has over 500 Million ADA on their balance sheet. This capital can fund needed parts of the Cardano community.\n\n- 350M ADA NCL doesn't mean we have to spend 350M ADA.\n\nResponse: It's very likely we'll spend significantly more ADA with a 350M NCL, than a 200M NCL. I also believe it's important that we set a standard of being fiscally conservative with our budget instead of spending 20% (if NCL is spent) of the entire treasury in the first year of governance.\n\n- Treasury income is greater than 300M per year. Therefore spending 300-350M is okay.\n\nResponse: This income is generated from the 20% tax on staking rewards. Meaning that as inflation decreases, this income will decrease as it's not actual income from transactions. Inflation should not be used as a basis for income, or for spending.\n\nCardano has always moved slowly and methodically to do the right thing. We are not the move fast and break things blockchain. We build the right way for the future. \n\nWe need to treat the launch of Cardano governance in the same way. \n\nWe need to have a smaller budget for the period that's left in 2025, and take this time to create a better process, better tooling for dReps, and better communication so we're all on the same page. A budget for 2025 isn't something we need to \"get over the line\", it's something that we need to get right."
}
