{
  "rationale": "I'm voting YES with 50 Million+ ADA as a dRep for the Cardano Constitution to Replace the Interim Constitution.\n\nI went to Argentina not as a delegate, I went there with my girlfriend and a camera. I flew us out there on my own dime. We actually got stuck in Colombia for a night on the way there.\n\nOn the way there I must admit I was reluctant to the idea of people deciding what the constitution would say without my input, or the input of the people that couldn't make it to the event.\n\nWe arrived there a day late to the Facultad de Derecho in Buenos Aires. As I walked into the building towards the main discussion area, I was reminded of the years that led up to this day. There were pictures and descriptions of each Cardano era: Byron, Shelley, Goguen, Basho, Voltaire. After you pass through the first corridor there was a hallway with a flag from each representative country. \n\nIt was another reminder of how truly global this community is. These people aren't just stats on your YouTube analytics, each flag represents a different upbringing, perspective, community, and a unique hope to make the World a better place.\n\nAfter that staunch reminder of why we're all here I entered the main discussion hall to a room full of people deliberating on how Cardano ought to be governed. I sat down in the back and just listened.\n\nAs I watched different delegates from different parts of the World try to represent their communities I was amazed at the quality of work actually being done. The biggest thing that stood out to me was the change in limitation of only one budget per year to any number of budgets per year. That's a huge change that I believe will benefit the entire Cardano community. Now we're not required to fund marketing if we also want to fund Leios.\n\nThere were also decisions that were made on the constitution where I sat in the back and just cringed. \"Why would they include something that's not enforceable on-chain?\" and \"Why are we spending so much time on this topic that doesn't matter?\" I thought.\n\nDuring the breaks I would walk up to random delegates from random jurisdictions to interview them both on-camera and off. I would ask them what's most important to them, how will they vote, etc. I watched many delegates' stances on voting change throughout the event.\n\nThrough these interviews, I realized that a lot of my ideas were already being represented. Even though I—and many people at home—didn’t have direct input, we could have contacted our local representative to give our input. We could have also attended one of the 63 workshops hosted around the World. That input then could have been brought to the stage and enacted in the constitution.\n\nThroughout this event I realized that the Cardano community can govern itself, and it's time. The constitution isn't perfect but it's a remarkable body of work that will push the entire cryptocurrency industry forward at minimum. As the constitution evolves it could push the way we govern the World forward.\n\nCardano community, it's time for you to step up. If you believe you have the time/capability to become a dRep do it. If you don't, it's time for you to delegate to one of the great dReps in our ecosystem. \n\nCardano is changing the World, it's up to you to decide how much.\n\nOriginal: https://x.com/bigpeyYT/status/1889025301759582476"
}
